# CON SQLAlquemy

In [1]:
#!pip install SQLAlchemy
#!pip install pymysql

In [2]:
from sqlalchemy import create_engine
import pandas as pd
import sqlalchemy

In [3]:
supersecretpass = open("../.txt","r").read() #metida en el .gitignore

### String y Motor de conexión:

In [4]:
# string de conexion = lenguaje+driver://usuario:password@servidor:puerto/database

str_con=f'mysql+pymysql://root:{supersecretpass}@localhost:3306'

motor=create_engine(str_con)  # motor de conexion
inspector = sqlalchemy.inspect(motor) #Solo para listar las DB del localhost
db_list = inspector.get_schema_names()
print(db_list)

['information_schema', 'mydb', 'mysql', 'performance_schema', 'publications', 'sys']

In [5]:
str_con=f'mysql+pymysql://root:{supersecretpass}@localhost:3306/publications' #Cambiamos la str de conexion a publications.
motor=create_engine(str_con)
#motor.execute('use publications') --> lo mimso que cambiar la string directamente, con execute sería + rápido de cambiar
pd.read_sql('select * from sales', motor).head() #Correcto, funcionado

  stor_id   ord_num   ord_date  qty    payterms title_id
0    6380      6871 1994-09-14    5      Net 60   BU1032
1    6380      722a 1994-09-13    3      Net 60   PS2091
2    7066     A2976 1993-05-24   50      Net 30   PC8888
3    7066  QA7442.3 1994-09-13   75  ON invoice   PS2091
4    7067     D4482 1994-09-14   10      Net 60   PS2091

In [6]:
#motor.execute('''drop table Sales_Royalty''')<--Había creado ya una tabla llamada así, he tenido que dropear

## Challenge 1:

In [7]:
motor.execute('''
    create temporary table publications.sales_royalty

    SELECT 
            authors.au_id as Author_ID,
            titles.title as Title_ID,
            titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100 as Sales_royalty
            
    FROM authors

    LEFT JOIN titleauthor ON titleauthor.au_id=authors.au_id
    LEFT JOIN titles ON titleauthor.title_id=titles.title_id
    LEFT JOIN sales ON sales.title_id=titles.title_id
    WHERE title is not NULL
            ''')

In [8]:
motor.execute('''
    create temporary table publications.Titles_royalty
    SELECT
        Title_ID,
        Author_ID,
        SUM(sales_royalty) as 'Titles_royalty'
        
    FROM publications.sales_royalty
    
    GROUP BY Author_ID, Title_ID

            ''')

In [9]:
motor.execute('''
    create temporary table publications.Author_royalty
    
    SELECT Author_ID, SUM(Titles_royalty) as Author_royalty
    
    FROM publications.Titles_royalty
    
    GROUP BY Author_ID
            ''')

In [10]:
pd.read_sql('''
    SELECT * FROM publications.Author_royalty
    ORDER BY Author_royalty DESC
    LIMIT 3;
        ''',motor)

     Author_ID  Author_royalty
0  238-95-7766         110.160
1  998-72-3567          88.456
2  807-91-6654          83.800

## Challenge 2:

In [11]:
pd.read_sql('''
    SELECT authors.au_id as Author_ID,
    titles.title as Title,
    titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100 as Sales_royalty
    
    FROM authors
    
    LEFT JOIN titleauthor ON titleauthor.au_id=authors.au_id
    LEFT JOIN titles ON titleauthor.title_id=titles.title_id
    LEFT JOIN sales ON sales.title_id=titles.title_id
    
    WHERE title is not NULL
    ORDER BY Sales_royalty DESC
    ''',motor).head(10)

,Author_ID,Title,Sales_royalty
0,238-95-7766,But Is It User Friendly?,110.160
1,807-91-6654,"Onions, Leeks, and Garlic: Cooking Secrets of ...",83.800
2,846-92-7186,Secrets of Silicon Valley,50.000
3,427-17-2319,Secrets of Silicon Valley,50.000
4,899-46-2035,Is Anger the Enemy?,49.275
5,998-72-3567,Is Anger the Enemy?,49.275
6,648-92-1872,Fifty Years in Buckingham Palace Kitchens,33.460
7,756-30-7391,Computer Phobic AND Non-Phobic Individuals: Be...,32.385
8,274-80-9391,Straight Talk About Computers,29.985
9,172-32-1176,Prolonged Data Deprivation: Four Case Studies,29.985

In [12]:
query_sum='''
    SELECT Author_ID, Title, SUM(Sales_royalty) as 'Titles_royalty'
    
    FROM (
        SELECT
            titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100 as 'Sales_royalty',
            authors.au_id as 'Author_ID',
            titles.title as 'Title'
        FROM authors
        
        LEFT JOIN titleauthor ON titleauthor.au_id=authors.au_id
        LEFT JOIN titles ON titleauthor.title_id=titles.title_id
        LEFT JOIN sales ON sales.title_id=titles.title_id
        
        WHERE title is not NULL
            ) as Sales_royalty_table
    GROUP BY Author_ID, Title
    ORDER BY Author_ID DESC
    '''
pd.read_sql(query_sum,motor).head()

     Author_ID                      Title  Titles_royalty
0  998-72-3567        Is Anger the Enemy?          70.956
1  998-72-3567          Life Without Fear          17.500
2  899-46-2035        Is Anger the Enemy?          70.956
3  899-46-2035      The Gourmet Microwave           7.176
4  846-92-7186  Secrets of Silicon Valley          50.000

In [13]:
query_tot='''
    SELECT Author_ID, SUM(Titles_royalty) as 'Author_royalty'
    FROM (
        SELECT Author_ID, Title, SUM(Sales_royalty) as 'Titles_royalty'
            FROM (
                SELECT
                titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100 as 'Sales_royalty',
                authors.au_id as 'Author_ID',
                titles.title as 'Title'
                
                FROM authors
                
                LEFT JOIN titleauthor ON titleauthor.au_id=authors.au_id
                LEFT JOIN titles ON titleauthor.title_id=titles.title_id
                LEFT JOIN sales ON sales.title_id=titles.title_id
                WHERE title is not NULL
                    ) as Sales_royalty_table
        GROUP BY Author_ID, Title
            ) as Sales_royalty
    GROUP BY Author_ID
    ORDER BY SUM(Titles_royalty) DESC
    LIMIT 3;
    '''
pd.read_sql(query_tot,motor)

     Author_ID  Author_royalty
0  238-95-7766         110.160
1  998-72-3567          88.456
2  807-91-6654          83.800

In [14]:
motor.execute('''drop table if exists most_profiting_authors''')
motor.execute('''
        CREATE table most_profiting_authors
        
        SELECT * 
        
        FROM publications.Author_royalty
        ''')

In [15]:
pd.read_sql('''
        SELECT
        Author_ID as Author,
        Author_royalty as Royalty
        
        FROM most_profiting_authors
        
        ORDER BY Author_royalty DESC
        
        LIMIT 3;
        ''',motor)

        Author  Royalty
0  238-95-7766  110.160
1  998-72-3567   88.456
2  807-91-6654   83.800

## MYSQL CONNECTOR:

In [16]:
# !pip install mysql-connector-python

In [17]:
#import mysql.connector as conn

In [18]:
#supersecretpass = open("../.txt","r").read()

In [19]:
# Creamos la conexión:
#
#db_con=conn.connect(host='localhost',
#                     user='root',
#                     passwd=supersecretpass)
#
#cursor=db_con.cursor()

In [20]:
#cursor.execute('show databases') # Check desde Hall del Servidor para ver que está la DB deseada, PUBLICATIONS
#for x in cursor:
#    print(x)

In [21]:
#cursor.execute('select\
#            titleauthor.title_id as titleID,\
#            titleauthor.au_id as authorID,\
#            (titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100) as Royalty\
#            from  titleauthor\
#            left join titles on titleauthor.title_id = titles.title_id\
#            left join sales on titles.title_id=sales.title_id \
#            group by titleauthor.au_id\
#            order by Royalty desc')

In [22]:
# Conectamos directamente con la DB PUBLICATIONS
#db=conn.connect(host='localhost',
#                     user='root',
#                     passwd=supersecretpass,
#                     database='publications')
#cursor=db.cursor()

## CHALLENGE 1

In [23]:
#for x in cursor:
#   print(x)

## PostgreSQL: